# -*- encoding : utf-8 -*-

Category.create([
                    { name: 'Купить',    alt: 'kupit',  parent_id: 0 },
                    { name: 'Квартиру',  alt: 'kvartiru',  parent_id: 1 },
                    { name: 'Комнату',   alt: 'komnatu',   parent_id: 1 },
                    { name: 'Таунхаус',  alt: 'taunhaus',  parent_id: 1 },
                    { name: 'Коттедж',   alt: 'kottedj',   parent_id: 1 },
                    { name: 'Продать',   alt: 'prodat', parent_id: 0 },
                    { name: 'Сдать',     alt: 'sdat',   parent_id: 0 },
                    { name: 'Снять',     alt: 'snyat',  parent_id: 0 }
                ])

page_description = 'Нет данных. Отредактируйте страницу в панели администратора.'
Page.create([
                { name: 'Срочный выкуп кавартиры',  alt: 'srochniy_vikup_kvartiri', title: 'Срочный выкуп кавартиры',  description: page_description },
                { name: 'Кредит на квартиру',       alt: 'kredit_na_kvartiru',      title: 'Кредит на квартиру',       description: page_description },
                { name: 'Стоимость услуг',          alt: 'stoimost_uslug',          title: 'Стоимость услуг',          description: page_description },
                { name: 'О нас',                    alt: 'o_nas',                   title: 'О нас',                    description: page_description },
                { name: 'Контакты',                 alt: 'kontakti',                title: 'Контакты',                 description: page_description },
                { name: 'Реклама',                  alt: 'reklama',                 title: 'Реклама',                  description: page_description },
                { name: 'Карта сайта',              alt: 'karta_sayta',             title: 'Карта сайта',              },
                { name: 'Оставить отзыв',           alt: 'ostavit_otziv',           title: 'Оставить отзыв',           description: page_description },
                { name: 'Подарки',                  alt: 'podarki',                 title: 'Подарки',                  description: page_description },
                { name: 'Скидки',                   alt: 'skidki',                  title: 'Скидки',                   description: page_description },
                { name: 'Страницы не существует',   alt: '404',                     title: 'Страницы не существует',   description: page_description }
            ])

post_description = 'Это тестовая запись. Отредакутируйте или удалите её в панели администратора.'
Post.create([
                { id: 0, name: 'Срочный выкуп кавартиры',  alt: 'srochniy_vikup_kvartiri', title: 'Срочный выкуп кавартиры', description: post_description,  category_id: 3 }
            ])


metros_json = [
        {
            line: "Сокольническая линия",
            stations: ["Улица Подбельского", "Черкизовская", "Преображенская площадь", "Сокольники", "Красносельская", "Комсомольская", "Красные ворота", "Чистые пруды", "Лубянка", "Охотный ряд", "Библиотека имени Ленина", "Кропоткинская", "Парк культуры", "Фрунзенская", "Спортивная", "Воробьёвы горы", "Университет", "Проспект Вернадского", "Юго-Западная"]
        },
        {
            line: "Замоскворецкая линия",
            stations: ["Красногвардейская", "Домодедовская", "Орехово", "Царицыно", "Кантемировская", "Каширская", "Коломенская", "Автозаводская", "Павелецкая", "Новокузнецкая", "Театральная", "Тверская", "Маяковская", "Белорусская", "Динамо", "Аэропорт", "Сокол", "Войковская", "Водный стадион", "Речной вокзал"]
        },
        {
            line: "Арбатско-Покровская линия",
            stations: ["Щёлковская", "Первомайская", "Измайловская", "Партизанская", "Семёновская", "Электрозаводская", "Бауманская", "Курская", "Площадь Революции", "Арбатская", "Смоленская", "Киевская", "Парк Победы", "Славянский бульвар", "Кунцевская", "Молодёжная", "Крылатское", "Строгино", "Мякинино", "Волоколамская", "Митино"]
        },
        {
            line: "Филёвская линия",
            stations: ["Кунцевская", "Пионерская", "Филевский парк", "Багратионовская", "Фили", "Кутузовская", "Студенческая", "Киевская", "Смоленская", "Арбатская", "Александровский сад", "Выставочная", "Международная"]
        },
        {
            line: "Кольцевая линия",
            stations: ["Парк культуры", "Октябрьская", "Добрынинская", "Павелецкая", "Таганская", "Курская", "Комсомольская", "Проспект Мира", "Новослободская", "Белорусская", "Краснопресненская", "Киевская"]
        },
        {
            line: "Калужско-Рижская линия",
            stations: ["Медведково", "Бабушкинская", "Свиблово", "Ботанический сад", "ВДНХ", "Алексеевская", "Рижская", "Проспект Мира", "Сухаревская", "Тургеневская", "Китай-город", "Третьяковская", "Октябрьская", "Шаболовская", "Ленинский проспект", "Академическая", "Профсоюзная", "Новые Черёмушки", "Калужская", "Беляево", "Коньково", "Тёплый стан", "Ясенево", "Новоясеневская"]
        },
        {
            line: "Таганско-Краснопресненская линия",
            stations: ["Планерная", "Сходненская", "Тушинская", "Щукинская", "Октябрьское поле", "Полежаевская", "Беговая", "Улица 1905 года", "Баррикадная", "Пушкинская", "Кузнецкий мост", "Китай-город", "Таганская", "Пролетарская", "Волгоградский проспект", "Текстильщики", "Кузьминки", "Рязанский проспект", "Выхино"]
        },
        {
            line: "Калининская линия",
            stations: ["Новогиреево", "Перово", "Шоссе Энтузиастов", "Авиамоторная", "Площадь Ильича", "Марксистская", "Третьяковская"]
        },
        {
            line: "Серпуховско-Тимирязевская линия",
            stations: ["Алтуфьево", "Бибирево", "Отрадное", "Владыкино", "Петровско-Разумовская", "Тимирязевская", "Дмитровская", "Савёловская", "Менделеевская", "Цветной бульвар", "Чеховская", "Боровицкая", "Полянка", "Серпуховская", "Тульская", "Нагатинская", "Нагорная", "Нахимовский проспект", "Севастопольская", "Чертановская", "Южная", "Пражская", "Улица академика Янгеля", "Аннино", "Бульвар Дмитрия Донского"]
        },
        {
            line: "Люблинско-Дмитровская линия",
            stations: ["Марьина роща", "Достоевская", "Трубная", "Сретенский бульвар", "Чкаловская", "Римская", "Крестьянская застава", "Дубровка", "Кожуховская", "Печатники", "Волжская", "Люблино", "Братиславская", "Марьино"]
        },
        {
            line: "Каховская линия",
            stations: ["Каширская", "Варшавская", "Каховская"]
        },
        {
            line: "Бутовская линия",
            stations: ["Улица Старокачаловская", "Улица Скобелевская", "Бульвар адмирала Ушакова", "Улица Горчакова", "Бунинская аллея"]
        }
    ]

metros = []
metros_json.map do |metro|
  metro[:stations].map do |station|
    metros << { name: station }
  end
end

Metro.create(metros)

